<!-- dflook/terraform-github-actions {"workspace":"dflook-patch-1","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"52d99b5518194ba13b1a1cac74796c167f784ae3d1304de77c789ca015028f8a","plan_job_ref":"Job Test plan target and replace #355 at https://github.com/dflook/terraform-github-actions/actions/runs/5889751451","plan_hash":"ffcdfd0c5fa1ec68fe2a92a3f13dd020a86ede3ff36c17f7bebf4f68a4bc1c2b","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __dflook-patch-1__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "gjVAzLd6Y1" -> (known after apply)
  ~ foreach = "FTe5AcNd01" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #355](https://github.com/dflook/terraform-github-actions/actions/runs/5889751451)